app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)

  def create
    @order = Order.new(params[:order])
    @order.status = "payment-expected"
    params[:products].each do |p|
      id = p[0]
      @order.trainings << Training.find_by_id(id)
    end

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("status", "customer_name", "updated_at", "created_at") VALUES(NULL, 'propria', '2009-10-28 19:09:50', '2009-10-28 19:09:50')
SELECT * FROM "trainings" WHERE ("trainings"."id" = '1') LIMIT 1
UPDATE "trainings" SET "updated_at" = '2009-10-28 18:40:48' WHERE "id" = 1

  def pay
    @order = Order.find(params[:id])
    raise :can_not_pay if !@order.can_pay?

    # payment = Payment.from_xml params[:payment]

    # @order.pay(payment)
    @order.save
---
SELECT * FROM "orders" WHERE ("orders"."id" = 15)
UPDATE "orders" SET "status" = 'preparing', "updated_at" = '2009-11-01 23:30:48' WHERE "id" = 15

  def destroy
    @order = Order.find(params[:id])
    raise :can_not_cancel if !order.can_cancel?
    @order.status = 'cancelled'
    @order.save
---
SELECT * FROM "orders" WHERE ("orders"."id" = 11)
UPDATE "orders" SET "status" = 'CANCELLED', "updated_at" = '2009-10-28 19:03:28' WHERE "id" = 11