app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "updated_at", "created_at") VALUES('chocolate', '2009-10-21 11:36:15', '2009-10-21 11:36:15')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save