app/controllers/trainings_controller.rb

  def index
    @trainings = Training.all
---
SELECT * FROM "trainings"

  def show
    @training = Training.find(params[:id])
---
SELECT * FROM "trainings" WHERE ("trainings"."id" = 1)

  def create
    @training = Training.new(params[:training])

    respond_to do |format|
      if @training.save
---
INSERT INTO "trainings" ("name", "updated_at", "price", "created_at") VALUES('fj11', '2009-10-28 18:23:09', 100.0, '2009-10-28 18:23:09')